Nicolasr3/core-misterino/samd/2023.1.26/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Misterino ZERO (Native USB Port)
# --------------------------------------
misterino_zero.name=Misterino ZERO (Native USB Port)
misterino_zero.vid.0=0x2341
misterino_zero.pid.0=0x804d
misterino_zero.vid.1=0x2341
misterino_zero.pid.1=0x004d
misterino_zero.vid.2=0x2341
misterino_zero.pid.2=0x824d
misterino_zero.vid.3=0x2341
misterino_zero.pid.3=0x024d
misterino_zero.upload_port.0.vid=0x2341
misterino_zero.upload_port.0.pid=0x804d
misterino_zero.upload_port.1.vid=0x2341
misterino_zero.upload_port.1.pid=0x004d
misterino_zero.upload_port.2.vid=0x2341
misterino_zero.upload_port.2.pid=0x824d
misterino_zero.upload_port.3.vid=0x2341
misterino_zero.upload_port.3.pid=0x024d
misterino_zero.upload_port.4.board=misterino_zero

misterino_zero.upload.tool=bossac
misterino_zero.upload.tool.default=bossac
misterino_zero.upload.tool.network=arduino_ota
misterino_zero.upload.protocol=sam-ba
misterino_zero.upload.maximum_size=262144
misterino_zero.upload.maximum_data_size=32768
misterino_zero.upload.use_1200bps_touch=true
misterino_zero.upload.wait_for_upload_port=true
misterino_zero.upload.native_usb=true
misterino_zero.build.mcu=cortex-m0plus
misterino_zero.build.f_cpu=48000000L
misterino_zero.build.usb_product="Misterino ZERO"
misterino_zero.build.usb_manufacturer="Mister"
misterino_zero.build.board=SAMD_ZERO
misterino_zero.build.core=arduino
misterino_zero.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
misterino_zero.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
misterino_zero.build.openocdscript=openocd_scripts/arduino_zero.cfg
misterino_zero.build.variant=misterino_zero
misterino_zero.build.variant_system_lib=
misterino_zero.build.vid=0x2341
misterino_zero.build.pid=0x804d
misterino_zero.bootloader.tool=openocd
misterino_zero.bootloader.tool.default=openocd
misterino_zero.bootloader.file=zero/samd21_sam_ba.bin
